MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN32VFM5/mcu.h
#define Transmit Channel Enable       0x00010000      // Enables a data channel for a transmit operation. A channel must be enabled before its FIFO is accessed.
#define Word Flag Configuration       0x00000078      // Configures which word sets the start of word flag. The value written must be one less than the word number. For example, writing 0 configures the first word in the frame. When configured to a value greater than TCR4[FRSZ], then the start of word flag is never set.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR4 register.
//
//*****************************************************************************

#define Frame Size                    0x00780000      // Configures the number of words in each frame. The value written should be one less than the number of words in the frame (for example, write 0 for one word per frame). The maximum supported frame size is 16 words.
#define Sync Width                    0x0001F000      // Configures the length of the frame sync in number of bit clocks. The value written must be one less than the number of bit clocks. For example, write 0 for the frame sync to assert for one bit clock only. The sync width cannot be configured longer than the first word of the frame.
#define MSB First                     0x00000010      // Specifies whether the LSB or the MSB is transmitted/received first.
#define Frame Sync Early              0x00000008      // 
#define Frame Sync Polarity           0x00000002      // Configures the polarity of the frame sync.
#define Frame Sync Direction          0x00000001      // Configures the direction of the frame sync.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR5 register.
//
//*****************************************************************************

#define Word N Width                  0x1F0000000      // Configures the number of bits in each word, for each word except the first in the frame. The value written must be one less than the number of bits per word. The value of WNW must be greater than or equal to the value of W0W even when there is only one word in each frame. Word width of less than 8 bits is not supported.
#define Word 0 Width                  0x01F00000      // Configures the number of bits in the first word in each frame. The value written must be one less than the number of bits in the first word. Word width of less than 8 bits is not supported if there is only one word per frame.
#define First Bit Shifted             0x0001F000      // Configures the bit index for the first bit transmitted for each word in the frame. If configured for MSB First, the index of the next bit transmitted is one less than the current bit transmitted. If configured for LSB First, the index of the next bit transmitted is one more than the current bit transmitted. The value written must be greater than or equal to the word width when configured for MSB First. The value written must be less than or equal to 31-word width when configured for LSB First.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TDRn register.
//
//*****************************************************************************

#define Transmit Data Register        0x7FFFFFFF80000000      // The corresponding TCR3[TCE] bit must be set before accessing the channel's transmit data register. Writes to this register when the transmit FIFO is not full will push the data written into the transmit data FIFO. Writes to this register when the transmit FIFO is full are ignored.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TFRn register.
//
//*****************************************************************************

#define Write FIFO Pointer            0x001C0000      // FIFO write pointer for transmit data channel.
#define Read FIFO Pointer             0x0000001C      // FIFO read pointer for transmit data channel.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TMR register.
//
//*****************************************************************************

#define Transmit Word Mask            0x7FFF8000      // Configures whether the transmit word is masked for each word in the frame.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCSR register.
//
//*****************************************************************************

#define Receiver Enable               0x80000000      // Enables/disables the receiver. When software clears this field, the receiver remains enabled, and this bit remains set, until the end of the current frame.
#define Stop Enable                   0x40000000      // Configures receiver operation in Stop mode. This bit is ignored and the receiver is disabled in all low-leakage stop modes.
#define Debug Enable                  0x20000000      // Enables/disables receiver operation in Debug mode. The receive bit clock is not affected by Debug mode.
#define Bit Clock Enable              0x10000000      // Enables the receive bit clock, separately from RE. This field is automatically set whenever RE is set. When software clears this field, the receive bit clock remains enabled, and this field remains set, until the end of the current frame.
#define FIFO Reset                    0x02000000      // Resets the FIFO pointers. Reading this field will always return zero.
#define Software Reset                0x01000000      // Resets the internal receiver logic including the FIFO pointers. Software-visible registers are not affected, except for the status registers.
#define Word Start Flag               0x00100000      // Indicates that the start of the configured word has been detected. Write a logic 1 to this field to clear this flag.
#define Sync Error Flag               0x00080000      // Indicates that an error in the externally-generated frame sync has been detected. Write a logic 1 to this field to clear this flag.
#define FIFO Error Flag               0x00040000      // Indicates that an enabled receive FIFO has overflowed. Write a logic 1 to this field to clear this flag.
#define FIFO Warning Flag             0x00020000      // Indicates that an enabled receive FIFO is full.
#define FIFO Request Flag             0x00010000      // Indicates that the number of words in an enabled receive channel FIFO is greater than the receive FIFO watermark.
#define Word Start Interrupt Enable   0x00001000      // Enables/disables word start interrupts.
#define Sync Error Interrupt Enable   0x00000800      // Enables/disables sync error interrupts.
#define FIFO Error Interrupt Enable   0x00000400      // Enables/disables FIFO error interrupts.
#define FIFO Warning Interrupt Enable 0x00000200      // Enables/disables FIFO warning interrupts.
#define FIFO Request Interrupt Enable 0x00000100      // Enables/disables FIFO request interrupts.
#define FIFO Warning DMA Enable       0x00000002      // Enables/disables DMA requests.
#define FIFO Request DMA Enable       0x00000001      // Enables/disables DMA requests.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR1 register.
//
//*****************************************************************************

#define Receive FIFO Watermark        0x00000006      // Configures the watermark level for all enabled receiver channels.


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR2 register.
//
//*****************************************************************************

